// Task 1. Выведите в консоль числа от 1 до n используя цикл for. (Дано: n = 10)

// for (let i = 1; i <= 10; i++) {
//     console.log(i);
// }

// Task 2. Выведите в консоль числа от 1 до n используя цикл while. (Дано: n = 10)

// let i = 1;
// while (i <= 10) {
//     console.log(i);
//     i++;
// }

// Task 3. Используя цикл while, выведите в консоль числа от n до 1. (Дано: n = 10)

// let n = 10;

// while (n >= 1) {
//   console.log(n);
//   n--;
// }

// Task 4. Напишите цикл, который выводит все четные числа от 1 до n. (Дано: n = 50)

// let n = 50;

// for (let i = 2; i <= n; i += 2) {
//   console.log(i);
// }